app/Http/Controllers/FrontEndController.php

                'features'=>$features,
                'availableLanguages'=>$availableLanguages,
                'locale'=>$locale,
                'pages'=>Pages::where('showAsLink', 1)->get(),
---
select * from `pages` where `showAsLink` = 1

            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();
---
select * from `tables` where `restaurant_id` = 1