app/Http/Controllers/ItemsController.php

insert into `categories` (`name`, `description`, `restorant_id`, `parent_id`, `image`, `order_index`, `updated_at`, `created_at`) values ('hello', 'subacteg dd', '1', '3', '4e2ff5e2-b464-4f77-aa9b-222e1edc6034', 12, '2022-06-04 12:54:54', '2022-06-04 12:54:54')
---
    public function subcategory(Request $request)
    {

        $category = new Categories;

        $category->name = strip_tags($request->subcategory_name);
        $category->description = strip_tags($request->item_description);
        $category->restorant_id = $request->restorant_id;
        $category->parent_id = $request->category_id;

        if ($request->hasFile('subcategory_image')) {
            $category->image = $this->saveImageVersions(
                $this->imageSubPath,
                $request->subcategory_image,
                [
                    ['name'=>'large', 'w'=>590, 'h'=>400],
                    //['name'=>'thumbnail','w'=>300,'h'=>300],
                    ['name'=>'medium', 'w'=>295, 'h'=>200],
                    ['name'=>'thumbnail', 'w'=>200, 'h'=>200],
                ]
            );
        }
        $category->save();